; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v7 - type_1 ?v2 - type_3)
 	      (pred_1 ?v6 - object ?v2 - type_3)
	      (pred_2 ?v7 - type_1 ?v1 - type_2)
	      (pred_3 ?v7 - type_1 ?v6 - object ?v1 - type_2))

   (:action op_1
       :parameters  (?v7 - type_1 ?v4 ?v5 - type_3)
       :precondition (and  (pred_4 ?v7 ?v4))
       :effect (and  (pred_4 ?v7 ?v5)
		     (not (pred_4 ?v7 ?v4))))

   (:action op_2
       :parameters (?v7 - type_1 ?v3 - object ?v8 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_1 ?v3 ?v8) (pred_4 ?v7 ?v8) (pred_2 ?v7 ?v1))
       :effect (and (pred_3 ?v7 ?v3 ?v1)
		    (not (pred_1 ?v3 ?v8)) 
		    (not (pred_2 ?v7 ?v1))))

   (:action op_3
       :parameters (?v7 - type_1 ?v3 - object ?v8 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_3 ?v7 ?v3 ?v1) (pred_4 ?v7 ?v8))
       :effect (and (pred_1 ?v3 ?v8)
		    (pred_2 ?v7 ?v1)
		    (not (pred_3 ?v7 ?v3 ?v1)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_10 - type_1
obj_07 obj_04 - type_2
obj_09 obj_03 obj_08 obj_01 - type_3
obj_06 obj_02 obj_05 - object)
(:init
(pred_4 obj_10 obj_03)
(pred_2 obj_10 obj_07)
(pred_2 obj_10 obj_04)
(pred_1 obj_06 obj_09)
(pred_1 obj_02 obj_01)
(pred_1 obj_05 obj_08)
)
(:goal
(and
(pred_1 obj_06 obj_09)
(pred_1 obj_02 obj_03)
(pred_1 obj_05 obj_09)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_10 ?b obj_07))))
)
)

; plan
1. (op_1 obj_10 obj_03 obj_01)
   deleted: (pred_4 obj_10 obj_03)
   added: (pred_4 obj_10 obj_01)
   goals met: 1 of 3
2. (op_2 obj_10 obj_02 obj_01 obj_04)
   deleted: (pred_1 obj_02 obj_01) (pred_2 obj_10 obj_04)
   added: (pred_3 obj_10 obj_02 obj_04)
   goals met: 1 of 3
3. (op_1 obj_10 obj_01 obj_08)
   deleted: (pred_4 obj_10 obj_01)
   added: (pred_4 obj_10 obj_08)
   goals met: 1 of 3
4. (op_1 obj_10 obj_08 obj_03)
   deleted: (pred_4 obj_10 obj_08)
   added: (pred_4 obj_10 obj_03)
   goals met: 1 of 3
5. (op_3 obj_10 obj_02 obj_03 obj_04)
   deleted: (pred_3 obj_10 obj_02 obj_04)
   added: (pred_1 obj_02 obj_03) (pred_2 obj_10 obj_04)
   goals met: 2 of 3
6. (op_1 obj_10 obj_03 obj_08)
   deleted: (pred_4 obj_10 obj_03)
   added: (pred_4 obj_10 obj_08)
   goals met: 2 of 3
7. (op_2 obj_10 obj_05 obj_08 obj_04)
   deleted: (pred_1 obj_05 obj_08) (pred_2 obj_10 obj_04)
   added: (pred_3 obj_10 obj_05 obj_04)
   goals met: 2 of 3
8. (op_1 obj_10 obj_08 obj_09)
   deleted: (pred_4 obj_10 obj_08)
   added: (pred_4 obj_10 obj_09)
   goals met: 2 of 3
9. (op_3 obj_10 obj_05 obj_09 obj_04)
   deleted: (pred_3 obj_10 obj_05 obj_04)
   added: (pred_1 obj_05 obj_09) (pred_2 obj_10 obj_04)
   goals met: 3 of 3
